
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ФинансовыеОперации Приход
	Движения.ФинансовыеОперации.Записывать = Истина;
	Для Каждого ТекСтрокаПоступления Из Поступления Цикл
		Движение = Движения.ФинансовыеОперации.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Событие = ТекСтрокаПоступления.Событие;
		Движение.Друг = ТекСтрокаПоступления.Друг;
		Движение.Сумма = ТекСтрокаПоступления.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
